app/controllers/products_controller.rb

SELECT  `products`.* FROM `products` WHERE (title LIKE('%%'))  ORDER BY id ASC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `products` WHERE (title LIKE('%%'))
---
  def index
    # productsテーブルから最新順に作品を２０件取得する
    @products = Product.all.order('id ASC').where('title LIKE(?)', "%#{params[:keyword]}%").page(params[:page]).per(20)

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1  ORDER BY `products`.`id` ASC LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 2
---
  def show
    # productsテーブルから該当するidの作品情報を取得し@productの変数へ代入する処理を書いて下さい
    @product = Product.find(params[:id])
    @reviews = Review.where(product_id: params[:id])