app/controllers/reviews_controller.rb

INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('aaa', 3, '???\r\n', 1, '2018-07-07 14:35:28', '2018-07-07 14:35:28')
---
  def create
    Review.create(create_params)