app/controllers/users_controller.rb

  def show
    @reviews = Review.where(user_id: current_user.id).includes(:product)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` IN (1, 2, 3, 4, 11, 9, 19)
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 2