app/views/products/index.html.erb

                      <p class="text-small">
                        <% if product.reviews.present? %>
---
SELECT AVG(rare) FROM `reviews` WHERE `reviews`.`product_id` = 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1